# file location: ${HOME}/Brewfile

# This file is used along with the `brew bundle` command to ensure that required packages and apps are installed.
# Also can be used to ensure that any package/apps that were installed as experimentation are uninstalled from the system.
# For a more detailed explanation of the philosophy/reasoning behind this file, please see https://openfolder.sh/macos-migrations-with-brewfile

# There are some common shell aliases that I have setup in the `${HOME}/.aliases` file for ease of running/typing (and also don't need to remember all those commands by-heart!).
# If you are using my `${HOME}/.aliases`, they will already be present for you.

# set global preferences for all 'brew install' commands
cask_args appdir: '/Applications', fontdir: '/Library/Fonts', adopt: true

# java_present = system('/usr/libexec/java_home --failfast')
is_arm = ::Hardware::CPU.arm?
# is_beta_os = ::OS::Mac::full_version.unsupported_release?

# TODO: Hardcoding of the dotfiles repo folder - since that env var is not available inside this env
setup_login_items_script = "${HOME}/.config/dotfiles/scripts/setup-login-item.sh"

# These casks must come first -- required for manual login during a vanilla OS installation.
cask 'font-meslo-lg-nerd-font'
cask 'keybase',
  postinstall: "\"#{setup_login_items_script}\" -a 'Keybase' && " \
               "ln -sf '/Applications/Keybase.app/Contents/SharedSupport/bin/keybase' \"${HOMEBREW_PREFIX}/bin/keybase\" && " \
               "ln -sf '/Applications/Keybase.app/Contents/SharedSupport/bin/git-remote-keybase' \"${HOMEBREW_PREFIX}/bin/git-remote-keybase\""

# formulae pulled in from homebrew to replace system equivalents to fix any security issues since the OS was released
# This list is enhanced from https://macgnu.codewithshin.com/?id=gnu-programs-existing-in-macos-which-are-outdated
brew 'bash'
brew 'curl'
brew 'git'
brew 'gmp'  # required for ruby installation
brew 'grep'
brew 'less'
brew 'libyaml'  # required for ruby installation
brew 'openssl'
brew 'readline'  # required for ruby installation
brew 'rsync'
brew 'sqlite3'
brew 'vim'
brew 'wget'
brew 'zsh'

# formulae pulled in for base configs (if these are absent, you will get errors and things won't work)
brew 'antidote'
brew 'delta'
brew 'direnv'
brew 'eza'
brew 'git-extras'
brew 'git-tools'
brew 'git-trim'
brew 'mise'
brew 'starship'

cask 'ghostty'

# FIRST_INSTALL: While re-imaging the OS or setting up for the first time, install only the bare minimum apps/utilities above this line so that the rest of the backup restoration can proceed faster.

# formulae pulled in for advanced configs (these are optional, but still recommended)
brew 'bat'
brew 'btop'
brew 'jaq'
brew 'mole'
brew 'ncdu'
brew 'pandoc'
brew 'syncthing'
brew 'tlrc'

cask 'dbeaver-community'
cask 'firefox@nightly' #, greedy: true
cask 'google-chrome'
cask 'keycastr', postinstall: "\"#{setup_login_items_script}\" -a 'Keycastr'"
cask 'keyclu', postinstall: "\"#{setup_login_items_script}\" -a 'KeyClu'" if is_arm
cask 'protonvpn', postinstall: "\"#{setup_login_items_script}\" -a 'ProtonVPN'"
cask 'rancher' # if ::OS::Mac::version < 26
cask 'shortcat', postinstall: "\"#{setup_login_items_script}\" -a 'Shortcat'"
cask 'stats', postinstall: "\"#{setup_login_items_script}\" -a 'Stats'"
cask 'zed',
  postinstall: "ln -sf '/Applications/Zed Preview.app/Contents/MacOS/cli' \"${HOMEBREW_PREFIX}/bin/zed-preview\" && " \
               "ln -sf \"${HOMEBREW_PREFIX}/bin/zed-preview\" \"${HOMEBREW_PREFIX}/bin/zed\""
cask 'zen@twilight'
cask 'zoom'
cask 'alfred'

# local AI coding tools
tap 'jundot/omlx', 'git@github.com/jundot/omlx'
# Note: Switched to using omlx instead of ollama on Apple M* laptop
# reference: https://www.agileguy.ca/opencode-fully-local/
# brew 'ollama', link: true, restart_service: :changed
brew 'omlx', restart_service: :changed if is_arm
brew 'opencode'

# ----------------------------------------------------------------------------------------------------------
# Miscellaneous formulae and casks grouped separately to keep the main lists clean.

# ---- general utilities
cask 'brave-browser'
cask 'claude-code'
cask 'codeql'
cask 'fliqlo'
cask 'floorp' # Doesn't have keyboard shortcuts to switch across workspaces
cask 'git-credential-manager'   # https://docs.github.com/en/get-started/getting-started-with-git/caching-your-github-credentials-in-git
cask 'intellij-idea'
cask 'knockknock'   # app to find persistently installed softwares/services/malwares
cask 'lulu'
cask 'microsoft-teams'
cask 'netspot'
cask 'ngrok'
cask 'silicon' if is_arm
cask 'thunderbird@daily'
cask 'visual-studio-code'
